app/controllers/actions_controller.rb

SELECT "actions".* FROM "actions"
---
  def index
    @actions = Action.all

SELECT "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_action
      @action = Action.find(params[:id])