app/controllers/entities_controller.rb

SELECT "entities".* FROM "entities"
---
  def index
    @entities = Entity.all

SELECT "entities".* FROM "entities" WHERE "entities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_entity
      @entity = Entity.find(params[:id])