app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"