app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # render json: @user, status: :created, location: @user
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def user_list
    @user = User.find(params[:id])
    @user_list = UserRelationship.where(user_one_id: @user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_relationships".* FROM "user_relationships" WHERE "user_relationships"."user_one_id" = $1  [["user_one_id", 2]]

  def user_friends
    @user = User.find(params[:id])
    @user_friends = UserRelationship.where(user_one_id: @user, status: 'Accepted')
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_relationships".* FROM "user_relationships" WHERE "user_relationships"."user_one_id" = $1 AND "user_relationships"."status" = $2  [["user_one_id", 2], ["status", "Accepted"]]