app/controllers/users_controller.rb

SELECT "user_relationships".* FROM "user_relationships" WHERE "user_relationships"."user_two_id" = $1 LIMIT $2  [["user_two_id", 2], ["LIMIT", 1]]
---
  def user_list
    @user_list = UserRelationship.where("user_one_id = ? or user_two_id = ?", @user, @user)