app/controllers/user_relationships_controller.rb

  def index
    @user_relationships = UserRelationship.all
---
SELECT "user_relationships".* FROM "user_relationships"

  def create
    @user_relationship = UserRelationship.new(user_relationship_params)

    if @user_relationship.save
---
INSERT INTO "user_relationships" ("user_one_id", "user_two_id", "status", "last_user_action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_one_id", 2], ["user_two_id", 10], ["status", "Pending"], ["last_user_action_id", 2], ["created_at", "2020-09-15 16:31:14.538692"], ["updated_at", "2020-09-15 16:31:14.538692"]]

    def set_user_relationship
      @user_relationship = UserRelationship.find(params[:id])
---
SELECT "user_relationships".* FROM "user_relationships" WHERE "user_relationships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]